# 7) Создайте список-матрешку,
# в который поместите два элемента: целое число и вложенный список,
# в который поместите еще два элемента: вещественное число и вложенный список,
# в который поместите еще два элемента: комплексное число и вложенный список,
# в который поместите еще три элемента: пустой список целое число и строку "Иголка".
# Выведите на экран конечную строку.


my_list = [1, [2.3, [4 + 5j, [[], 6, "Иголка"]]]]
print(my_list)
