# 2) Найти самое длинное слово из массива. Реализовать двумя видами циклов

words = ['палаверды', 'пока', 'привет']

print(max(words, key=len))